Repository: nvda-es/TeleNVDA
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fi

source: Your NVDA Remote configuration was corrupted and has been reset.
fi: NVDA-etäkäyttö-asetuksesi olivat vioittuneet ja ne on nyt nollattu.

source: NVDA Remote Configuration Error
fi: NVDA-etäkäytön asetusvirhe

source: Connect...
fi: Yhdistä...

source: Remotely connect to another computer running NVDA Remote Access or TeleNVDA
fi: Yhdistä toiseen NVDA-etäkäyttöä tai TeleNVDA:ta käyttävään tietokoneeseen

source: Disconnect
fi: Katkaise yhteys

source: Disconnect from another computer running NVDA Remote Access or TeleNVDA
fi: Katkaise yhteys toiseen NVDA-etäkäyttöä tai TeleNVDA:ta käyttävään tietokoneeseen

source: Mute remote
fi: Mykistä etäkone

source: Mute speech and sounds from the remote computer
fi: Mykistä etäkoneen äänet ja puhe.

source: &Push clipboard
fi: &Lähetä leikepöytä

source: Push the clipboard to the other machine
fi: Lähetä leikepöydän sisältö toiseen tietokoneeseen

source: Send &file...
fi: Lähetä t&iedosto...

source: Send a file to the other machine
fi: Lähetä tiedosto toiselle tietokoneelle

source: Copy &link
fi: Kopioi &linkki

source: Copy a link to the remote session
fi: Kopioi linkki etäistuntoon

source: &Options...
fi: &Asetukset...

source: Options
fi: Asetukset

source: Send Ctrl+Alt+Del
fi: Lähetä Ctrl+Alt+Del

source: R&emote
fi: &Etäkäyttö

source: Not connected.
fi: Ei yhdistetty.

source: Choose the file you want to send to the remote computer
fi: Valitse tiedosto, jonka haluat lähettää etätietokoneelle

source: All files (*.*)
fi: Kaikki tiedostot (*.*)

source: This file is too large. Only files smaller than 10 MB are supported.
fi: Tämä tiedosto on liian suuri. Vain alle 10 Mt:n kokoisia tiedostoja tuetaan.

source: Error
fi: Virhe

source: The session will be blocked until the transfer is complete. Are you sure you want to continue?
fi: Istunto estetään, kunnes siirto on valmis. Haluatko varmasti jatkaa?

source: Warning!
fi: Varoitus

source: File sent
fi: Tiedosto lähetetty

source: Sends the specified file to the remote machine
fi: Lähettää määritetyn tiedoston etäkoneelle

source: Sends the contents of the clipboard to the remote machine
fi: Lähettää leikepöydän sisällön etäkoneelle

source: Clipboard pushed
fi: Leikepöytä lähetetty

source: Unable to push clipboard
fi: Leikepöytää ei voi lähettää

source: Disconnected!
fi: Yhteys katkaistu.

source: Error Connecting
fi: Virhe yhdistettäessä

source: Unable to connect to the remote computer
fi: Etätietokoneeseen ei saada yhteyttä

source: Connect
fi: Yhdistä

source: Connected!
fi: Yhdistetty

source: Connection interrupted
fi: Yhteys keskeytetty

source: The option to handle keys from other applications is disabled in your NVDA keyboard settings. In order to allow the keyboard of this machine to be controlled, this option should be enabled. Would you like to do this now?
fi: Muiden sovellusten näppäinpainallusten käsittelyn asetus ei ole käytössä NVDA:n näppäimistöasetuksissa. Asetuksen on oltava käytössä, jotta tämän koneen näppäimistöä voidaan hallita. Haluatko ottaa sen käyttöön nyt?

source: Warning
fi: Varoitus

source: Connected to control server
fi: Yhdistetty hallintapalvelimeen

source: TeleNVDA is already connected. Disconnect before opening a new connection.
fi: TeleNVDA on jo yhdistetty. Katkaise yhteys ennen uuden muodostamista.

source: TeleNVDA Already Connected
fi: TeleNVDA on jo yhdistetty

source: Do you wish to control the machine on server {server} with key {key}?
fi: Haluatko hallita konetta palvelimella {server}, jonka avain on {key}?

source: Do you wish to allow this machine to be controlled on server {server} with key {key}?
fi: Haluatko sallia tämän koneen hallinnan palvelimella {server}, jonka avain on {key}?

source: TeleNVDA Connection Request
fi: TeleNVDA-yhteyspyyntö

source: Copies a link to the remote session to the clipboard
fi: Kopioi etäistuntoon viittaavan linkin leikepöydälle

source: Copied link
fi: Linkki kopioitu

source: Opens a dialog to start a remote session
fi: Avaa valintaikkunan etäistunnon aloittamista varten

source: Disconnect a remote session
fi: Katkaise etäistunnon yhteys

source: Set the host to ignore the next gesture completely, sending next gesture to the guest as is. Useful when you need to use the gesture asigned to toggle between guest and host, in the guest machine.
fi: Määritä isäntä ohittamaan kokonaan seuraava näppäinkomento ja lähettämään se etäkoneelle sellaisenaan. Tästä on hyötyä, kun sinun tarvitsee käyttää etä- ja isäntäkoneen välillä vaihtavaa näppäinkomentoa etäkoneessa.

source: Send next gesture to the guest
fi: Lähetä seuraava näppäinkomento etäkoneelle

source: Toggles the control between guest and host machine
fi: Vaihtaa hallinnan etä- ja isäntäkoneen välillä

source: Controlling remote machine.
fi: Hallitaan etäkonetta.

source: Controlling local machine.
fi: Hallitaan paikallista konetta.

source: Mute or unmute the speech coming from the remote computer
fi: Mykistä tai poista etätietokoneelta tulevan puheen mykistys

source: Unmute speech and sounds from the remote computer
fi: Poista etäkoneen äänien ja puheen mykistys

source: &Host:
fi: &Isäntä:

source: &Key:
fi: &Avain:

source: &Generate Key
fi: &Luo avain

source: Host must be set.
fi: Isäntä on määritettävä.

source: Get External &IP
fi: Hae ulkoinen &IP

source: &External IP:
fi: &Ulkoinen IP:

source: &Port:
fi: &Portti:

source: Successfully retrieved IP address. Port {port} is open.
fi: IP-osoite haettu onnistuneesti. Portti {port} on avoinna.

source: Success
fi: Onnistui

source: Retrieved external IP, but port {port} is not currently forwarded.
fi: Ulkoinen IP haettu, mutta porttia {port} ei ole uudelleenohjattu.

source: Unable to contact portcheck server, please manually retrieve your IP address
fi: Portintarkistuspalvelimeen ei saada yhteyttä. Hae IP-osoite manuaalisesti.

source: Client
fi: Asiakas

source: Server
fi: Palvelin

source: Control another machine
fi: Hallitse toista konetta

source: Allow this machine to be controlled
fi: Salli tämän koneen hallinta

source: Both host and key must be set.
fi: Isäntä ja avain on määritettävä.

source: Both port and key must be set.
fi: Portti ja avain on määritettävä.

source: Auto-connect to control server on startup
fi: Yhdistä hallintapalvelimeen automaattisesti käynnistyksen yhteydessä

source: Use Remote Control Server
fi: Käytä etähallintapalvelinta

source: Host Control Server
fi: Isännöi hallintapalvelinta

source: Play sounds instead of beeps
fi: Toista äänet piippausten asemesta

source: Process speech commands when controlling another computer
fi: Käsittele puhekomennot toista tietokonetta hallittaessa

source: Delete all trusted fingerprints
fi: Poista kaikki luotetut sormenjäljet

source: When connecting to an unauthorized server, you will again be prompted to accepts its certificate.
fi: Sinua kehotetaan valtuuttamattomaan palvelimeen yhdistäessäsi hyväksymään uudelleen sen varmenne.

source: Are you sure you want to delete all stored trusted fingerprints?
fi: Haluatko varmasti poistaa kaikki tallennetut luotetut sormenjäljet?

source: TeleNVDA Connection Security Warning
fi: TeleNVDA-yhteyden suojausvaroitus

source: Warning! The certificate of this server could not be verified. This connection may not be secure. It is possible that someone is trying to overhear your communication. Before continuing please make sure that the following server certificate fingerprint is a proper one. If you have any questions, please contact the server administrator. Server SHA256 fingerprint: {fingerprint} Do you want to continue connecting?
fi: Varoitus: Tämän palvelimen varmennetta ei voitu vahvistaa. Yhteys ei ehkä ole turvallinen. On mahdollista, että joku yrittää kuunnella viestejäsi. Varmista ennen jatkamista, että seuraava palvelinvarmenteen sormenjälki on oikea. Mikäli sinulla on kysyttävää, ota yhteyttä palvelimen ylläpitäjään. Palvelimen SHA256-sormenjälki: {fingerprint} Haluatko jatkaa yhdistämistä?

source: Connect and do not ask again for this server
fi: Yhdistä ja älä kysy uudelleen tästä palvelimesta

source: Clipboard updated
fi: Leikepöytä päivitetty

source: No permission on device to trigger CTRL+ALT+DEL from remote
fi: Laitteella ei ole lupaa suorittaa Ctrl+Alt+Del-näppäinyhdistelmää etäkoneelta

source: Choose where to save the received file
fi: Valitse, minne vastaanotettu tiedosto tallennetaan

source: File received
fi: Tiedosto vastaanotettu

source: The version of the relay server which you have connected to is not compatible with this version of the Remote Client. Please either use a different server or upgrade your version of the addon.
fi: Välittäjäpalvelimen versio, johon olet yhteydessä, ei ole yhteensopiva tämän etäkäyttöasiakaslisäosan kanssa. Ole hyvä ja käytä eri palvelinta tai päivitä käyttämäsi lisäosa.

source: Message of the Day
fi: Päivän viesti

source: Remote NVDA not connected.
fi: Etä-NVDA:ta ei yhdistetty.

source: Invalid URL
fi: Virheellinen URL

source: Unable to parse url "%s"
fi: URL-osoitetta "%s" ei voi jäsentää
